{
    "artist": "Nipsey Hussle",
    "title": "Double Up by Nipsey Hussle (Ft. Belly & DOM KENNEDY)",
    "url": "https://genius.com/Nipsey-hussle-double-up-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle &  Belly ] Double up Three or four times, I ain't tellin' no lies, I just run it up Never let a hard time humble us Double up I ain't tellin' no lies, I just (Yeah) I ain't  tellin ' no lies, I just Five, four, three, two That's time I got to you That money, my dreams come true My life in diamonds, who knew? Who knew? Who knew? [Verse 1: Nipsey Hussle] Turned seven to a fourteen Fourteen to a whole thing Lord knows it's a cold game Switched up on you hoes, man Big body take both lanes Backseat, blowin' propane All-black, five gold chains Young rich nigga bossed up on his own, man My new shit sound like it's \"Soul Train\" Tookie Williams over Coltrane Eric B by the rope chain RSC, we for sure bang Tiny Locs and they go crazy What you know about the dope game? Was you born in the '80s? Did your mama smoke cocaine? Have you ever seen a whole thang? But you drove to the streets 'cause you grew up on short change? Fucked up when the dope age It remind me when these rappers drop duds and they quotes change Had the part with the low fade I would stand in front of Nix with my sack for the whole day Drive-bys, that was road rage Then we park and hop out, learn levels to this whole thang Old school, play the O'Jays Tryna make a slow change, mama still slavin' for a low wage Tryna [Chorus: Nipsey Hussle &  Belly ] Double up (Yeah) Three or four times, I ain't tellin' no lies, I just run it up Never let a hard time humble us Double up I ain't tellin' no lies, I just (Yeah) I ain't tellin' no lies, I just Five, four, three, two That's time I got to you That money, my dreams come true My life in diamonds, who knew? Who knew? Who knew? [Post-Chorus: Belly &  DOM KENNEDY ] I'd leave it behind if you let me Ironic, I'd drown just to hold you down I'd jump off the ledge if you with me I bring you up, you just let me down Let me down ( Uh, let me down ) ( Need my All Money In chain too ) Let me down ( Woah , let me down, look out, look out) [Verse 2: DOM KENNEDY] It's hard to catch what you can't see I grew up to be who I wanna be, so The more niggas talk, I'ma shine Might've been way before its time Posted with my back against the wall Life is a bitch, but she mine The rag six-deuce, yeah, it's mine The Westside too, yeah, it's mine What you know about Your poster on the wall at the dealership? Leave her in the bed, legs tremblin' Gettin' banged on for your Pendletons What you know about Your response be the reason you exist? Lucky I ain't get caught up in the twist Young nigga, blue pager on my hip, so As the champagne spill And the car accelerate and the beat gon' cry I be goin' to the bank at least three, four times Getting handshakes from the branch managers We keep doing fly shit when the cameras cut [Chorus: Nipsey Hussle &  Belly ] Double up (Yeah) Three or four times, I ain't tellin' no lies, I just run it up Never let a hard time humble us Double up I ain't tellin' no lies, I just (Yeah) I ain't tellin' no lies, I just Five, four, three, two That's time I got to you That money, my dreams come true My life in diamonds, who knew? Who knew? Who knew? [Post-Chorus: Belly] I'd leave it behind if you let me Ironic, I'd drown just to hold you down I'd jump off the ledge if you with me I bring you up, you just let me down Let me down (Let me down) Let me down (Let me down, look out, look out)"
}{
    "artist": "Nipsey Hussle",
    "title": "Victory Lap by Nipsey Hussle (Ft. Stacy Barthe)",
    "url": "https://genius.com/Nipsey-hussle-victory-lap-lyrics",
    "lyrics": "[Intro: Stacy Barthe &  Arctic Monkeys ] Woah-oh Woah-oh Woah-oh Like the beginning of Mean Streets, you could  (Oh) Like the beginning of Mean Streets, you could Like the beginning of Mean Streets, you could [Verse 1: Nipsey Hussle &  Arctic Monkeys ] I'm prolific, so gifted I'm the type that's gon' go get it, no kiddin' Breaking down a Swisher front of your buildin' Sitting on the steps, feeling no feelings Last night, it was a cold killin' You gotta keep the devil in his hole, nigga But you know how it go, nigga I'm front line every time it's on, nigga Hunnid proof flow, run and shoot pro 458 drop, playin' \"Bullet Proof Soul\" Every few shows, I just buy some new gold Circle got smaller, everybody can't go Downtown, Diamond District, jewelers like, \"Yo Hussle, holla at me, I got Cubans on the low\" Flew to Cancun, smokin' Cubans on the boat Then docked at Tulum just to smoke, look Listening to music at the Mayan Ruins True devotion on the bluest ocean, cruisin' My cultural influence even rival Lucien I'm integrated vertically, y'all niggas blew it They tell me, \"Hussle, dumb it down, you might confuse 'em\" This ain't that weirdo rap you motherfuckers used to Like the beginning of Mean Streets I'm an urban legend, South Central in a certain section Can't express how I curved detectives Guess it's evidence of a divine presence, blessings Held me down, at times, I seem reckless, F it You got an L, but got an E for effort, stretched him Dropped him off in the Mojave desert, then left him Ain't no answer to these trick questions Money Makin' Nip, straighten out my jewelry on my bitch dresser Well known, flick up and jail pose Snatch a champagne bottle from Rico's 'til T show Whatever, nigga, playin' chess, not checkers, nigga Thirty-eight special for you clever niggas See, bro, if you ain't live and die by the street code Been through all these motions, up and down like a see-saw I can never view you as my equal Fuck I wanna hear your CD for? [Chorus: Stacy Barthe &  Arctic Monkeys ] Like the beginning of Mean Streets Like the beginning of Mean Streets Like the beginning of Mean Streets Like the beginning of Mean Streets Like the beginning of Mean Streets Like the beginning of Mean Streets (We gotta make it) Like the beginning of Mean Streets [Verse 2: Nipsey Hussle] Yeah, look I'm finna take it there This time around, I'ma make it clear Spoke some things into the universe and they appeared I say it's worth it, I won't say it's fair Find your purpose or you wastin' air Fuck it, though, y'all niggas scared Eyes opened, I can see it clear They don't make 'em bar none, they don't make 'em real They don't make it where I'm from, they don't take it here They ain't see in due time, I be makin' mils Bossed up in this game, I been makin' deals Get your lawyer on the phone, we can make it real I got checks and balance, I flex dramatic Other fifty on my neck, just my reckless habit Ain't no pussy on my rep, disrespect the savage I make one phone call and the rest get handled It's just another front step with candles Lil' message from the set, \"We accept your challenge\" [Outro: Stacy Barthe] Woah-oh Woah-oh Woah-oh Woah, woah We gotta make it, yeah, we gotta We gotta make it, oh, we gotta make it Oh, ah, ooh We gotta make it, oh Victory Lap"
}{
    "artist": "Nipsey Hussle",
    "title": "Double Up by Nipsey Hussle (Ft. Belly & DOM KENNEDY)",
    "url": "https://genius.com/Nipsey-hussle-double-up-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle &  Belly ] Double up Three or four times, I ain't tellin' no lies, I just run it up Never let a hard time humble us Double up I ain't tellin' no lies, I just (Yeah) I ain't  tellin ' no lies, I just Five, four, three, two That's time I got to you That money, my dreams come true My life in diamonds, who knew? Who knew? Who knew? [Verse 1: Nipsey Hussle] Turned seven to a fourteen Fourteen to a whole thing Lord knows it's a cold game Switched up on you hoes, man Big body take both lanes Backseat, blowin' propane All-black, five gold chains Young rich nigga bossed up on his own, man My new shit sound like it's \"Soul Train\" Tookie Williams over Coltrane Eric B by the rope chain RSC, we for sure bang Tiny Locs and they go crazy What you know about the dope game? Was you born in the '80s? Did your mama smoke cocaine? Have you ever seen a whole thang? But you drove to the streets 'cause you grew up on short change? Fucked up when the dope age It remind me when these rappers drop duds and they quotes change Had the part with the low fade I would stand in front of Nix with my sack for the whole day Drive-bys, that was road rage Then we park and hop out, learn levels to this whole thang Old school, play the O'Jays Tryna make a slow change, mama still slavin' for a low wage Tryna [Chorus: Nipsey Hussle &  Belly ] Double up (Yeah) Three or four times, I ain't tellin' no lies, I just run it up Never let a hard time humble us Double up I ain't tellin' no lies, I just (Yeah) I ain't tellin' no lies, I just Five, four, three, two That's time I got to you That money, my dreams come true My life in diamonds, who knew? Who knew? Who knew? [Post-Chorus: Belly &  DOM KENNEDY ] I'd leave it behind if you let me Ironic, I'd drown just to hold you down I'd jump off the ledge if you with me I bring you up, you just let me down Let me down ( Uh, let me down ) ( Need my All Money In chain too ) Let me down ( Woah , let me down, look out, look out) [Verse 2: DOM KENNEDY] It's hard to catch what you can't see I grew up to be who I wanna be, so The more niggas talk, I'ma shine Might've been way before its time Posted with my back against the wall Life is a bitch, but she mine The rag six-deuce, yeah, it's mine The Westside too, yeah, it's mine What you know about Your poster on the wall at the dealership? Leave her in the bed, legs tremblin' Gettin' banged on for your Pendletons What you know about Your response be the reason you exist? Lucky I ain't get caught up in the twist Young nigga, blue pager on my hip, so As the champagne spill And the car accelerate and the beat gon' cry I be goin' to the bank at least three, four times Getting handshakes from the branch managers We keep doing fly shit when the cameras cut [Chorus: Nipsey Hussle &  Belly ] Double up (Yeah) Three or four times, I ain't tellin' no lies, I just run it up Never let a hard time humble us Double up I ain't tellin' no lies, I just (Yeah) I ain't tellin' no lies, I just Five, four, three, two That's time I got to you That money, my dreams come true My life in diamonds, who knew? Who knew? Who knew? [Post-Chorus: Belly] I'd leave it behind if you let me Ironic, I'd drown just to hold you down I'd jump off the ledge if you with me I bring you up, you just let me down Let me down (Let me down) Let me down (Let me down, look out, look out)"
}{
    "artist": "Nipsey Hussle",
    "title": "Racks in the Middle by Nipsey Hussle (Ft. Hit-Boy & Roddy Ricch)",
    "url": "https://genius.com/Nipsey-hussle-racks-in-the-middle-lyrics",
    "lyrics": "[Intro: Roddy Ricch] ( Hit-Boy ) Yeah, yeah, yeah, yeah ( TrapAdix ) Yeah, yeah, yeah, yeah Yeah, I was ridin' ’round in the V-12 with the racks in the middle I was ridin' 'round in the V-12 with the racks in the middle Yeah, yeah, yeah, yeah Ay [Chorus: Roddy Ricch] I was riding ’round in the V-12 with the racks in the middle Had to pray to almighty God they let my dog out the kennel When you get it straight up out the mud, you can't imagine this shit I been pullin' up in the drop tops with the baddest bitches Young nigga been focused on my check (Mhmmhm) Got a new coupe wrapped around my neck  (Mhmmhm) Tryna put the water on my Patek (Mhmmhm) I got killers to the left of me (Mhmmhm) [Verse 1: Nipsey Hussle] We was lurking on 'em, ain't show no mercy on 'em We was goin' back to back, we put a curfew on 'em It was dark clouds on us, but that was perfect for us We know you always crash and burn, but it was working for us Limo tint the V-12, double check the details Gotta cross my T’s and dot my I’s or I can't sleep well Millions off of retail Once again, I prevail Knew that shit was over from the day I dropped my presale Hold up, let the beat build See me in the streets still I been fightin’ battles up a steep hill They gave my road dog twelve, it was a sweet deal And I been ridin' solo tryna rebuild Look [Chorus: Roddy Ricch] I was riding 'round in the V-12 with the racks in the middle Had to pray to almighty God they let my dog out the kennel When you get it straight up out the mud, you can't imagine this shit I been pullin’ up in the drop tops with the baddest bitches Young nigga been focused on my check (Mhmmhm) Got a new coupe wrapped around my neck (Mhmmhm) Tryna put the water on my Patek (Mhmmhm) I got killers to the left of me (Mhmmhm) [Verse 2: Nipsey Hussle] Look, under no condition would you ever catch me slippin' Motorcaded shooters plus the Maybach chauffeur driven If they catch me wit' it, gon' send me off to prison Judge ain't sympathizin', court don't show forgiveness Engine in the Lambo drownin' out the music Silk Dior with the flowers, five gold Cubans Champagne while I shop, hope I splurge foolish Closin' Escrow twice this month, both commercial units Damn, I wish my nigga Fatts was here How you die thirty somethin' after banging all them years? Grammy-nominated, in the sauna sheddin' tears All this money, power, fame and I can't make you reappear But I don't wipe 'em though We just embrace the only life we know If it was me, I would tell you, \"Nigga, live your life and grow\" I'd tell you, \"Finish what we started, reach them heights, you know? And gas the V-12 'til the pipe in smoke\" [Chorus: Roddy Ricch] I was ridin' 'round in the V-12 with the racks in the middle Had to pray to almighty God they let my dog out the kennel When you get it straight up out the mud, you can't imagine this shit I been pullin' up in the drop tops with the baddest bitches Young nigga been focused on my check (Mhmmhm) Got a new coupe wrapped around my neck (Mhmmhm) Tryna put the water on my Patek (Mhmmhm) I got killers to the left of me (Mhmmhm) [Verse 3: Nipsey Hussle] Another million dollar bail, that's just some regular shit See my granny on a jet, some shit I'll never forget Next day we flew to Vegas, with my Puma connects We break bread, we ain't new to success Bleed music, invest, enterprise, take lucrative steps Cold game, but I knew it was Chess As a youth in the set Learn the game, you a student at best But it's a couple things you can expect Look, just like money know money, nigga, shooters respect Other shooters we was both, don't want my crew on your neck I'm on the freeway in a drop, it got me losing my breath I do the dash with the blues on the deck [Outro: Roddy Ricch] Mhmmhm Mhmmhm Mhmmhm Mhmmhm Mhmmhm"
}{
    "artist": "Nipsey Hussle",
    "title": "Dedication by Nipsey Hussle (Ft. Kendrick Lamar)",
    "url": "https://genius.com/Nipsey-hussle-dedication-lyrics",
    "lyrics": "[Verse 1: Nipsey Hussle] Look, my nigga this is dedication, this is anti-hesitation This a real nigga celebration This a Dime Blocc declaration 59th and 5th Ave, granny house with vanilla wafers This the remedy, the separation 2Pac of my generation, blue pill in the fuckin' Matrix Red rose in the gray pavement Young black nigga trapped and he can't change it Know he a genius, he just can't claim it 'Cause they left him no platforms to explain it He frustrated so he get faded But deep down inside he know you can't fade him How long should I stay dedicated? How long 'til opportunity meet preparation? I need some real nigga reparations 'Fore I run up in your bank just for recreation [Chorus: Nipsey Hussle] Dedication, hard work plus patience The sum of all my sacrifice, I'm done waitin' I'm done waitin', told you that I wasn't playin' Now you hear what I been sayin' Dedication It's dedication, look [Verse 2: Kendrick Lamar] I spent my whole life thinkin' out the box Boxin' homies three-on-one, got DP'ed but I ain't drop Chirp on me, here I come, brrt, spin around the block They blurped on me, said I ran a stop sign but that's a lie I spent my whole life starin' at the stage Playin' Sega, daddy smokin' sherm, mama playin' spades Catchin' vapors, grandma said I'd get some Jordans for my grades That's my baby, when she died my heart broke a hundred ways I spent my whole life tryna make it, tryna chase it The cycle of a black man divided, tryna break it You take a loss? Shit, don't cry about it, just embrace it Minor setback for major comeback, that's my favorite My nigga L said, \"You do a song with Nip, K. Dot, he a better Crip\" I said, \"He a man first, you hear the words out his lips About flourishing from the streets to black businesses?\" Level four, yard livin', given to false imprisonment Listen close, my nigga It's bigger than deuces and fours, my nigga Since elementary we close, my nigga, yeah, straight like that I give you the game, go back to the turf and give it right back For generations we been dealt bad hands with bad plans Prove your dedication by hoppin' out Grand Am's I'm at the premiere politickin' with Top, Nip, and Snoop Damn, Pac watchin' the way we grew, from dedication [Interlude: Kendrick Lamar] If it ain't congratulate then it look like hate If it ain't congratulate then it look like what, Nipsey? Hol' up [Verse 3: Nipsey Hussle] Look This ain't entertainment, it's for niggas on the slave ship These songs just the spirituals I swam against them waves with Ended up on shore to they amazement Now I hope the example I set's not contagious Lock us behind gates but can't tame us Used to be, \"Stay safe,\" now it's, \"Stay dangerous\" 'Cause ain't no point in playin' defense, nigga That's why I dove off the deep end, nigga, without a life jacket Couple mil', tour the world, dawg, my life crackin' Cook the books, bring it back so it's no taxes Royalties, publishing, plus I own masters I'll be damned if I slave for some white crackers I was mappin' this out, I hit the heist backwards Hoppin' out the eighty-five in Reebok Classics Ran a couple marathons just to get established To make it happen, you got to have it [Chorus: Nipsey Hussle] Dedication, hard work plus patience The sum of all my sacrifice, I'm done waitin' I'm done waitin', told you that I wasn't playin' Now you hear what I been sayin' Dedication It's dedication"
}{
    "artist": "Nipsey Hussle",
    "title": "Hussle & Motivate by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-hussle-and-motivate-lyrics",
    "lyrics": "[Verse 1: Nipsey Hussle] Pull up in motorcades, I got a show today This all I'm tryna do, hustle and motivate Choppers a throwaway, hustle the Hova way That's why they follow me, huh? They think I know the way 'Cause I took control of things, ballin' the solo way And if you pattern my trend, I make you my protege Slauson Ave soldier raised, niggas don't know them days Take you in back of the buildings, make you expose your age Take you across the tracks, make you explode a face Now you official now, but you got a soul to save I just been cookin' that new, I'm 'bout to drop in a few Think if I call it the great, the people gon' call it the truth Ain't really trip on the credit, I just paid all of my dues I just respected the game, now my name all in the news Trippin' on all of my moves, quote me on this, got a lot more to prove Remember I came in this bitch fresh out the county with nothin' to lose [Chorus: Maurice David Wade] And I don't do this for nothin', nah, from the ground up, yeah But I don't do this shit for nothin', no, no, not at all, yeah My mama need rent, ma need rent, yeah, she do, aw yeah So I don't do this shit for nothin', no, not at all, all I told her I got it, oh, yeah So I don't do this shit for nothin', not at all, from the ground up Hustle and motivate (Woo) [Verse 2: Nipsey Hussle] Back in this bitch like I never left Stand for some shit that you never rep Passing through stages in life Through the ups and the downs like it's all just another test Live by the rules like a fuckin' ref I got respect in a hundred sets Too many chains, need another chest Playin' no games if it wasn't chess Cut from that cloth that you couldn't stretch Cut from that circle you couldn't test Heavily pressured and under stress Even though niggas ain't show it, we was a mess Honest attempt, play him to the left Judge a young nigga by they address Left us no option, what they expect? Only thing we knew for sure was to bang the set Fuck livin' basic, I'm takin' risks Fuck what they sayin', I'm sayin' this Don't waste your time, it don't make you rich It don't mean nothin', so fuck 'em, let's make a grip Double up, triple up, make it six Ballin' so hard, you could pay a bitch Lead to the lake if they wanna fish Make sure them niggas around you stick to the script This should be written in stone You should come visit my zone Don't take my word, double-check all of my flows Ask 'em how Hussle got on But fuck what you heard This is for who walked down that road Sold everything but they soul Straight off the curb,  real niggas rich as you nerds Addressed to whom it may concern I don't do this for nothin', nah [Chorus: Maurice David Wade] From the ground up, yeah But I don't do this shit for nothin', no, no, not at all, yeah My mama need rent, ma need rent, yeah, she do, aw yeah So I don't do this shit for nothin', no, not at all, all I told her I got it, oh, yeah So I don't do this shit for nothin', not at all, from the ground up Hustle and motivate (Woo) [Outro: Maurice David Wade &  Nipsey Hussle ] Hustle and motivate, hustle and motiv— ( Cut the bass out ) Hustle and motiv—, hustle and motivate ( All Money In, nigga ) Hustle and motiv—, hustle and motiv— Hustle and motiv—, hustle and motivate ( Victory Lap )"
}{
    "artist": "Nipsey Hussle",
    "title": "Blue Laces 2 by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-blue-laces-2-lyrics",
    "lyrics": "[Chorus] Oh, aw, baby, it's been so long Oh, aw, baby, it's been so long [Verse 1] Mogul and they know that, logo on my floor mat Courtside, Chamberlain throwback match my Rolex Everywhere I go, flex, valet park on some Loc shit Whole lot of smoke in that 'Rari, that thang potent Burnin' rubber, wearin' cameras, they was undercovers Under pressure, made statements, turned on they brothers Never judge you, but the streets'll never love you I wonder what it come to in your brain for you to run to Ones  that  hate us, handcuff us and mace us Call us dumb niggas 'cause our culture is contagious Third-generation South Central gangbangers That lived long enough to see it changin' Think it's time we make arrangements Finally wiggle out they mazes Find me out in different places I'm the spook by the door, this the infiltration Double back dressed in blue laces [Chorus] Oh, aw, baby, it's been so long Oh, aw, baby, it's been so  long [Verse 2] They killed Dr. Sebi, he was teachin' health I fuck with Rick Ross 'cause he teachin' wealth Dropped out of school, I'ma teach myself Made my first mil' on my own, I don't need your help All black Tom Ford, it's a special evenin' City council meetin', they got Hussle speakin' Billion-dollar project, 'bout to crack the cement So what if our investments had become strategic? Summer 0-18, man, it's such a season 'Bout to make my partners look like fuckin' geniuses We was in the Regal, it was me and Steven We done took a dream and turned it to a zenith Anything I wanted, everything I needed Gotta pace yourself, it's all about your breathin' You can have it all, it's all about your reasons I done took my name and carved it in the cement [Chorus] Oh, aw, baby, it's been so long Oh, aw, baby, it's been so long [Verse 3] I flashback on that shootout at the beach, twenty deep You tried to squeeze, your gun jammed and they released Blood on your tee, how many stains? I see three The bitch started to panic, so I made her switch seats Drivin' now, police chopper, hear it flyin' now Really not too spooked, calmly asked me, \"Am I dyin' now?\" All I know is keep you calm and collected Crackin' jokes like, \"Nigga, now you gon' be finally respected\" See your blood leakin', got my foot on this gas Tossed the 40,  we pulled up to Daniel Free  and see  CRASH You know the alibi, they started shootin', we was standin' by Ain't see nothing but the flare from the talons fly I wasn't there, I was passin' by Matter fact, don't say shit, I'm just gon' drop you in the back and slide That's your weed, all the cash is mine I'll take 'em both to the spot plus your phone 'til you back online [Chorus] Oh, aw, baby, it's been so long Oh, aw, baby, it's been so long"
}{
    "artist": "Nipsey Hussle",
    "title": "Grinding All My Life by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-grinding-all-my-life-lyrics",
    "lyrics": "[Chorus] All my life, been grindin' all my life Sacrificed, hustled, paid the price Want a slice, got to roll the dice That's why all my life, I been grindin' all my life, look All my life, been grindin' all my life (Yup) Sacrificed, hustled, paid the price (Woah) Want a slice, got to roll the dice That's why all my life, I been grindin' all my life, look [Verse 1] I'm married to this game, that's who I made my wife Said I'd die alone, I told that bitch she probably right One thing that's for sure, not a stranger to this life Got a safe that's full of Franklins and a shoulder full of stripes (Ah) Don't know a nigga like myself I say self-made meanin' I designed myself County jail fades, you could pull my file yourself Spot raid, swallow rocks, I'm gettin' high myself Look, and damn right, I like the life I built I'm from Westside, 60, shit, I might got killed Standin' so tall, they think I might got stilts Legendary baller like Mike, like Wilt '96 Impala, thug life on wheels Up against the walls, squabble at Fox Hills Like a motherfuckin' boss, ask me how I feel Successful street nigga touchin' them first mils (Woah) [Chorus] All my life, been grindin' all my life Sacrificed, hustled, paid the price Want a slice, got to roll the dice That's why all my life, I been grindin' all my life, look All my life, been grindin' all my life (Yup) Sacrificed, hustled, paid the price (Woah) Want a slice, got to roll the dice That's why all my life, I been grindin' all my life, look [Verse 2] I got everythin' I said I was gon' get, on my kid In addition to that fact, I went legit, I'm the shit Now accordin' to the way that I'm positioned in this biz It look like I'm just gon' keep on gettin' rich (Ah) Know them Westside RSCs is us LAPD on my dick, I'ma squeeze and bust If a rap nigga diss, Swiss cheese his bus All this rap money, nigga, look, I need too much Money, loyalty and love, in the dream we trust You be switchin' up the players on your team too much Tiny Cobby, that's my Loc, Young Supreme, what's up? Ain't we travel 'round the world gettin' cream or what? Ain't you get off on whoever Hussle seem to rush? Las Vegas, strip pop, yeah, you creamed them punks After all that lookin' tough, all he seen was stumps 50 Cent and Mayweather fleed the scene with us True story [Chorus] All my life, been grindin' all my life Sacrificed, hustled, paid the price Want a slice, got to roll the dice That's why all my life, I been grindin' all my life, look All my life, been grindin' all my life (Yup) Sacrificed, hustled, paid the price (Woah) Want a slice, got to roll the dice That's why all my life, I been grindin' all my life, look"
}{
    "artist": "Nipsey Hussle",
    "title": "Last Time That I Checc'd by Nipsey Hussle (Ft. YG)",
    "url": "https://genius.com/Nipsey-hussle-last-time-that-i-checcd-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle] Last time that I checked It was five chains on my neck It was no smut on my rep Last time that I checked (Checked) I was sellin' zones in the set (Zones up in the set) Make a quarter mil' no sweat Last time that I checked I'm the streets' voice out West Legendary, self-made progress Last time that I checked (Checked) First, you get the money, then respect Then the power and the hoes come next Last time that I checked (Checked) [Verse 1: Nipsey Hussle] I been self-made from the dribble I was been sayin' I'ma kill em, look Playing no games with you niggas Pop clutch, switch lanes on you niggas, look I laid down the game for you niggas Taught you how to charge more than what they paid for you niggas Own the whole thing for you niggas Reinvest, double up, then explain for you niggas It gotta be love, who run the city? It gotta be cuz This for the pieces I took off the Monopoly board And y'all niggas' false claims, it gotta be fraud Just keep the hood up out your mouth or you gotta be charged I doubled up, tripled up, nigga, what? Banged on the whole game, I ain't give a fuck Nobody trippin', handled business, got my digits up And when I drop, you know I'm 'bout to fuck the city up [Chorus: Nipsey Hussle] Last time that I checked It was five chains on my neck It was no smut on my rep Last time that I checked (Checked) I was sellin' zones in the set (Zones up in the set) Make a quarter mil' no sweat Last time that I checked I'm the streets' voice out West Legendary, self-made progress Last time that I checked (Checked) First, you get the money, then respect Then the power and the hoes come next Last time that I checked (Checked) [Verse 2: Nipsey Hussle] And I come through fly (Check), no cosign I ain't need radio to do mine, I done fine And I take my time (Check), and take my tribe Every level that I crossed in this game like state lines It was visionary, either I'm genius or you niggas scary Maybe it's both, and this balance I deliver daily For every nigga in these streets tryna feed the babies The single mamas working hard not to miss a payment And dirty money get washed on royalty statements Black owners in this game of powerful racists Young niggas in the set that's doing it makeshift Out the garage is how you end up in charge That's how you end up in penthouses, end up in cars That's how you start off a curb-server, end up a boss That's how you win the whole thing and lift up a cigar With sweat dripping down your face 'cause the mission was hard [Chorus: Nipsey Hussle &  YG ] Last time that I checked It was five chains on my neck It was no smut on my rep Last time that I checked (Checked) I was sellin' zones in the set (Zones up in the set) Make a quarter mil' no sweat Last time that I checked I'm the streets' voice out West Legendary, self-made progress Last time that I checked (Checked) First, you get the money, then respect Then the power and the hoes come next ( Uh-oh ) Last time that I checked (Checked) [Verse 3: YG] I got the front end and the back We on the way and that's a fact (Facts, nigga) This real, this ain't rap Where everybody wanna act pro-Black (They don't really wanna fuck with us) The last lie you heard, this ain't that This that I done made it out the gutter shit Nip told you, \"Fuck the middleman,\" I told you, \"Fuck a bitch\" Fuck wearing they clothes, I wear my own shit Y'all can own y'all label, I own my own, bitch Ayy, Nip, I remember all that game you throwed me Don't fuck around and get played by these label owners Talk that shit to these niggas, Adrien Broner But secure the win, though, don't let that game fold you 'Cause when it's game over, it's really game over And all they do is play the game 'til this game over And you be giving game like a big brother Mission, never let 'em take it from us, no [Chorus: Nipsey Hussle] Last time that I checked It was five chains on my neck It was no smut on my rep Last time that I checked (Checked) I was sellin' zones in the set (Zones up in the set) Make a quarter mil' no sweat Last time that I checked I'm the streets' voice out West Legendary, self-made progress Last time that I checked (Checked) First, you get the money, then respect Then the power and the hoes come next Last time that I checked"
}{
    "artist": "Nipsey Hussle",
    "title": "Face the World by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-face-the-world-lyrics",
    "lyrics": "[Produced by 9th Wonder] [Intro: Sample] When all dreams seem to die The summer's gone, the breeze stops blowing The sun just leaves the sky [Verse 1] Yeah Uh Yeah, this your life, you can play with it You make your bed, you gon' lay in it Do your thing, just be safe with it Triple bunks in the state prison Blue laces in my blue chucks I ain't never gave two fucks BET I chucked the hood up Asking if that nigga Nip hood, what Like I wouldn't take it to the back with you Same nigga walk the track with you Same nigga shot a strap with you Same nigga bought a sack with you Nineteen touchin' two birds Alpinas off a few swerves Grey leather in my white Lincoln Shit smellin' like a new purse Two C's on my bitch shit My money risin' like Bisquick Six words help you get this Rich Rapper On Some Crip Shit I prayed for blessings as a young nigga Not to learn the hard lessons of a drug dealer Triple life with a gang enhancement The judge triple white and he hate your blackness Slam the gavel with a racist passion Got you waitin' on appeals but your patience passin' All you've got to offer is a fight It's too late to run to Christ once you caught up in this life Look [Hook: Sample] So face the world now or cry Face the world- So face- Face the world- [Verse 2] Look Don't cry tears, they don't fly here And if you don't die here, you supposed to fly lears 365 here is like a dog year No wonder why these niggas 20 and got white hairs Stressin' like they 40 and some change It's lonely in this game, all my homies is in pain And brodie is the slang, but it don't mean he your brother It don't mean you can trust him, it don't mean that he love you And we was raised wrong but we stayed strong And when we kept it real, we got faked on And when we showed up, we got flaked on While them niggas story's gettin' cake holmes I bet my life I'm a dice shaker Electric lights on a skyscraper It's up and downs for a real nigga But you'll be lame all your life, hater Mac-10 in my black Benz Show me signals of betrayal, can't be back friends Long flights get my mind right Victory to me is when you spend your time right Victory to me is when you get your grind right Victory to me is when you get your moms right Niggas, got this shit twisted Like Jean-Michel Basquiat destroyed his pictures Self-inflicted homicide, don't pull the trigger I feel like I got to tell you you got something to contribute Regardless what you into, regardless what you been through I feel like I got to tell you you got something to contribute Something to contribute [Hook: Sample] So face the world now (Now) So face the world, or So face the world"
}{
    "artist": "Nipsey Hussle",
    "title": "What It Feels Like by Nipsey Hussle & JAY-Z",
    "url": "https://genius.com/Nipsey-hussle-and-jay-z-what-it-feels-like-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle] And this is what it feels like (Feels like, feels like) And this is what it feels like (Feels like, feels like) [Verse 1: Nipsey Hussle] Look, the only reason I survive 'cause a nigga is special, first You get successful, then it get stressful, thirst Niggas gon' test you, see what your texture's worth Diamonds and pipes, one of 'em pressure bursts Street nigga, still I get checks, in spurts I'm for peace, but before I get pressed, I murk Better days pray for but expectin' worse At this level, bullshit, I'm just less concernеd Cruisin' in the 6, lookin' at the proceeds of rap music on my wrist Drop another mixtapе, my shit boomin' out this bitch Young Malcolm, I'm the leader of the movement out this bitch, look And this is what it feels like (Feels like) Reach a level, make you question, \"Is it real life?\" All the weed good, all the pussy real tight And the only rule, keep your dollar bills right [Chorus: Nipsey Hussle] And this is what it feels like (Feels like, feels like) And this is what it feels like (Feels like, feels like) And this is what it feels like (Feels like, feels like) And this is what it feels like (Feels like, feels like) [Verse 2: JAY-Z] Scorpion bricks, way before Aubrey's double disc .40 on my lap, clap, sound like 40 did the mix Filtered bass, sift coke like a Michelin star chef Chef kiss to my wrist, I go dummy with my left IRS on my dick try to audit all my checks, too late You know they hate when you become more than they expect You let them crackers storm your Capitol, put they feet up on your desk And yet you talkin' tough to me, I lost all my little respect I'm sellin' weed in the open, bringin' folks home from the feds I know that payback's gon' be mean, I'm savin' all my little bread Pray for me, y'all, one day I'ma have to pay for these thoughts Real niggas is extinct, it ain't safe for me, my dawg They killin' niggas in they own hoods, that make sense to you at all? You burnt your bridge to the other side, you know you can't swim across Y'all know niggas can't swim, they fried Mike after he died Y'all know niggas can't win, you never land, all jokes aside I arrived on the day Fred Hampton got mur—, hol' up Assassinated, just to clarify further What y'all gave birth is the chairman mixed with Jeff Fort Big stepper on that jet with my legs crossed (Uh, uh) Black stones on my neck, y'all can't kill Christ (Uh) Black messiah is what I feel like (Woo) Shit ain't gonna stop 'cause y'all spilled blood We gon' turn up even more since y'all kill cuz' [Chorus: Nipsey Hussle] And this is what it feels like (Feels like, feels like) And this is what it feels like (Feels like, feels like) And this is what it feels like (Feels like, feels like) And this is what it feels like (Feels like, feels like) [Outro: Nipsey Hussle] And this is what it feels like (Feels like, feels like,  as it fuckin' should ) And this is what it feels like (Feels like, feels like,  feels so fuckin' good ) And this is what it feels like (Feels like, feels like) And this is what it feels like (Feels like, feels like,  feels so fuckin' good ) And this is what it feels like (Feels like, feels like) What it feels like"
}{
    "artist": "Nipsey Hussle",
    "title": "Victory Lap by Nipsey Hussle (Ft. Stacy Barthe)",
    "url": "https://genius.com/Nipsey-hussle-victory-lap-lyrics",
    "lyrics": "[Intro: Stacy Barthe & Arctic Monkeys]\nWoah-oh\nWoah-oh\nWoah-oh\nLike the beginning of Mean Streets, you could (Oh)\nLike the beginning of Mean Streets, you could\nLike the beginning of Mean Streets, you could\n\n[Verse 1: Nipsey Hussle & Arctic Monkeys]\nI'm prolific, so gifted\nI'm the type that's gon' go get it, no kiddin'\nBreaking down a Swisher front of your buildin'\nSitting on the steps, feeling no feelings\nLast night, it was a cold killin'\nYou gotta keep the devil in his hole, nigga\nBut you know how it go, nigga\nI'm front line every time it's on, nigga\nHunnid proof flow, run and shoot pro\n458 drop, playin' \"Bullet Proof Soul\"\nEvery few shows, I just buy some new gold\nCircle got smaller, everybody can't go\nDowntown, Diamond District, jewelers like, \"Yo\nHussle, holla at me, I got Cubans on the low\"\nFlew to Cancun, smokin' Cubans on the boat\nThen docked at Tulum just to smoke, look\nListening to music at the Mayan Ruins\nTrue devotion on the bluest ocean, cruisin'\nMy cultural influence even rival Lucien\nI'm integrated vertically, y'all niggas blew it\nThey tell me, \"Hussle, dumb it down, you might confuse 'em\"\nThis ain't that weirdo rap you motherfuckers used to\nLike the beginning of Mean Streets\nI'm an urban legend, South Central in a certain section\nCan't express how I curved detectives\nGuess it's evidence of a divine presence, blessings\nHeld me down, at times, I seem reckless, F it\nYou got an L, but got an E for effort, stretched him\nDropped him off in the Mojave desert, then left him\nAin't no answer to these trick questions\nMoney Makin' Nip, straighten out my jewelry on my bitch dresser\nWell known, flick up and jail pose\nSnatch a champagne bottle from Rico's 'til T show\nWhatever, nigga, playin' chess, not checkers, nigga\nThirty-eight special for you clever niggas\nSee, bro, if you ain't live and die by the street code\nBeen through all these motions, up and down like a see-saw\nI can never view you as my equal\nFuck I wanna hear your CD for?\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Double Up by Nipsey Hussle (Ft. Belly & DOM KENNEDY)",
    "url": "https://genius.com/Nipsey-hussle-double-up-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle & Belly]\nDouble up\nThree or four times, I ain't tellin' no lies, I just run it up\nNever let a hard time humble us\nDouble up\nI ain't tellin' no lies, I just (Yeah)\nI ain't tellin' no lies, I just\nFive, four, three, two\nThat's time I got to you\nThat money, my dreams come true\nMy life in diamonds, who knew?\nWho knew?\nWho knew?\n\n[Verse 1: Nipsey Hussle]\nTurned seven to a fourteen\nFourteen to a whole thing\nLord knows it's a cold game\nSwitched up on you hoes, man\nBig body take both lanes\nBackseat, blowin' propane\nAll-black, five gold chains\nYoung rich nigga bossed up on his own, man\nMy new shit sound like it's \"Soul Train\"\nTookie Williams over Coltrane\nEric B by the rope chain\nRSC, we for sure bang\nTiny Locs and they go crazy\nWhat you know about the dope game?\nWas you born in the '80s? Did your mama smoke cocaine?\nHave you ever seen a whole thang?\nBut you drove to the streets 'cause you grew up on short change?\nFucked up when the dope age\nIt remind me when these rappers drop duds and they quotes change\nHad the part with the low fade\nI would stand in front of Nix with my sack for the whole day\nDrive-bys, that was road rage\nThen we park and hop out, learn levels to this whole thang\nOld school, play the O'Jays\nTryna make a slow change, mama still slavin' for a low wage\nTryna\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Racks in the Middle by Nipsey Hussle (Ft. Hit-Boy & Roddy Ricch)",
    "url": "https://genius.com/Nipsey-hussle-racks-in-the-middle-lyrics",
    "lyrics": "[Intro: Roddy Ricch]\n(Hit-Boy)\nYeah, yeah, yeah, yeah\n(TrapAdix)\nYeah, yeah, yeah, yeah\nYeah, I was ridin' ’round in the V-12 with the racks in the middle\nI was ridin' 'round in the V-12 with the racks in the middle\nYeah, yeah, yeah, yeah\nAy\n\n[Chorus: Roddy Ricch]\nI was riding ’round in the V-12 with the racks in the middle\nHad to pray to almighty God they let my dog out the kennel\nWhen you get it straight up out the mud, you can't imagine this shit\nI been pullin' up in the drop tops with the baddest bitches\nYoung nigga been focused on my check (Mhmmhm)\nGot a new coupe wrapped around my neck (Mhmmhm)\nTryna put the water on my Patek (Mhmmhm)\nI got killers to the left of me (Mhmmhm)\n\n[Verse 1: Nipsey Hussle]\nWe was lurking on 'em, ain't show no mercy on 'em\nWe was goin' back to back, we put a curfew on 'em\nIt was dark clouds on us, but that was perfect for us\nWe know you always crash and burn, but it was working for us\nLimo tint the V-12, double check the details\nGotta cross my T’s and dot my I’s or I can't sleep well\nMillions off of retail\nOnce again, I prevail\nKnew that shit was over from the day I dropped my presale\nHold up, let the beat build\nSee me in the streets still\nI been fightin’ battles up a steep hill\nThey gave my road dog twelve, it was a sweet deal\nAnd I been ridin' solo tryna rebuild\nLook\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Dedication by Nipsey Hussle (Ft. Kendrick Lamar)",
    "url": "https://genius.com/Nipsey-hussle-dedication-lyrics",
    "lyrics": "[Verse 1: Nipsey Hussle]\nLook, my nigga this is dedication, this is anti-hesitation\nThis a real nigga celebration\nThis a Dime Blocc declaration\n59th and 5th Ave, granny house with vanilla wafers\nThis the remedy, the separation\n2Pac of my generation, blue pill in the fuckin' Matrix\nRed rose in the gray pavement\nYoung black nigga trapped and he can't change it\nKnow he a genius, he just can't claim it\n'Cause they left him no platforms to explain it\nHe frustrated so he get faded\nBut deep down inside he know you can't fade him\nHow long should I stay dedicated?\nHow long 'til opportunity meet preparation?\nI need some real nigga reparations\n'Fore I run up in your bank just for recreation\n\n[Chorus: Nipsey Hussle]\nDedication, hard work plus patience\nThe sum of all my sacrifice, I'm done waitin'\nI'm done waitin', told you that I wasn't playin'\nNow you hear what I been sayin'\nDedication\nIt's dedication, look\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Hussle & Motivate by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-hussle-and-motivate-lyrics",
    "lyrics": "[Verse 1: Nipsey Hussle]\nPull up in motorcades, I got a show today\nThis all I'm tryna do, hustle and motivate\nChoppers a throwaway, hustle the Hova way\nThat's why they follow me, huh? They think I know the way\n'Cause I took control of things, ballin' the solo way\nAnd if you pattern my trend, I make you my protege\nSlauson Ave soldier raised, niggas don't know them days\nTake you in back of the buildings, make you expose your age\nTake you across the tracks, make you explode a face\nNow you official now, but you got a soul to save\nI just been cookin' that new, I'm 'bout to drop in a few\nThink if I call it the great, the people gon' call it the truth\nAin't really trip on the credit, I just paid all of my dues\nI just respected the game, now my name all in the news\nTrippin' on all of my moves, quote me on this, got a lot more to prove\nRemember I came in this bitch fresh out the county with nothin' to lose\n\n[Chorus: Maurice David Wade]\nAnd I don't do this for nothin', nah, from the ground up, yeah\nBut I don't do this shit for nothin', no, no, not at all, yeah\nMy mama need rent, ma need rent, yeah, she do, aw yeah\nSo I don't do this shit for nothin', no, not at all, all\nI told her I got it, oh, yeah\nSo I don't do this shit for nothin', not at all, from the ground up\nHustle and motivate (Woo)\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Blue Laces 2 by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-blue-laces-2-lyrics",
    "lyrics": "[Chorus]\nOh, aw, baby, it's been so long\nOh, aw, baby, it's been so long\n\n[Verse 1]\nMogul and they know that, logo on my floor mat\nCourtside, Chamberlain throwback match my Rolex\nEverywhere I go, flex, valet park on some Loc shit\nWhole lot of smoke in that 'Rari, that thang potent\nBurnin' rubber, wearin' cameras, they was undercovers\nUnder pressure, made statements, turned on they brothers\nNever judge you, but the streets'll never love you\nI wonder what it come to in your brain for you to run to\nOnes that hate us, handcuff us and mace us\nCall us dumb niggas 'cause our culture is contagious\nThird-generation South Central gangbangers\nThat lived long enough to see it changin'\nThink it's time we make arrangements\nFinally wiggle out they mazes\nFind me out in different places\nI'm the spook by the door, this the infiltration\nDouble back dressed in blue laces\n\n[Chorus]\nOh, aw, baby, it's been so long\nOh, aw, baby, it's been so long\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Grinding All My Life by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-grinding-all-my-life-lyrics",
    "lyrics": "[Chorus]\nAll my life, been grindin' all my life\nSacrificed, hustled, paid the price\nWant a slice, got to roll the dice\nThat's why all my life, I been grindin' all my life, look\nAll my life, been grindin' all my life (Yup)\nSacrificed, hustled, paid the price (Woah)\nWant a slice, got to roll the dice\nThat's why all my life, I been grindin' all my life, look\n\n[Verse 1]\nI'm married to this game, that's who I made my wife\nSaid I'd die alone, I told that bitch she probably right\nOne thing that's for sure, not a stranger to this life\nGot a safe that's full of Franklins and a shoulder full of stripes (Ah)\nDon't know a nigga like myself\nI say self-made meanin' I designed myself\nCounty jail fades, you could pull my file yourself\nSpot raid, swallow rocks, I'm gettin' high myself\nLook, and damn right, I like the life I built\nI'm from Westside, 60, shit, I might got killed\nStandin' so tall, they think I might got stilts\nLegendary baller like Mike, like Wilt\n'96 Impala, thug life on wheels\nUp against the walls, squabble at Fox Hills\nLike a motherfuckin' boss, ask me how I feel\nSuccessful street nigga touchin' them first mils (Woah)\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Last Time That I Checc'd by Nipsey Hussle (Ft. YG)",
    "url": "https://genius.com/Nipsey-hussle-last-time-that-i-checcd-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle]\nLast time that I checked\nIt was five chains on my neck\nIt was no smut on my rep\nLast time that I checked (Checked)\nI was sellin' zones in the set (Zones up in the set)\nMake a quarter mil' no sweat\nLast time that I checked\nI'm the streets' voice out West\nLegendary, self-made progress\nLast time that I checked (Checked)\nFirst, you get the money, then respect\nThen the power and the hoes come next\nLast time that I checked (Checked)\n\n[Verse 1: Nipsey Hussle]\nI been self-made from the dribble\nI was been sayin' I'ma kill em, look\nPlaying no games with you niggas\nPop clutch, switch lanes on you niggas, look\nI laid down the game for you niggas\nTaught you how to charge more than what they paid for you niggas\nOwn the whole thing for you niggas\nReinvest, double up, then explain for you niggas\nIt gotta be love, who run the city? It gotta be cuz\nThis for the pieces I took off the Monopoly board\nAnd y'all niggas' false claims, it gotta be fraud\nJust keep the hood up out your mouth or you gotta be charged\nI doubled up, tripled up, nigga, what?\nBanged on the whole game, I ain't give a fuck\nNobody trippin', handled business, got my digits up\nAnd when I drop, you know I'm 'bout to fuck the city up\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Face the World by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-face-the-world-lyrics",
    "lyrics": "[Produced by 9th Wonder]\n\n[Intro: Sample]\nWhen all dreams seem to die\nThe summer's gone, the breeze stops blowing\nThe sun just leaves the sky\n\n[Verse 1]\nYeah\nUh\nYeah, this your life, you can play with it\nYou make your bed, you gon' lay in it\nDo your thing, just be safe with it\nTriple bunks in the state prison\nBlue laces in my blue chucks\nI ain't never gave two fucks\nBET I chucked the hood up\nAsking if that nigga Nip hood, what\nLike I wouldn't take it to the back with you\nSame nigga walk the track with you\nSame nigga shot a strap with you\nSame nigga bought a sack with you\nNineteen touchin' two birds\nAlpinas off a few swerves\nGrey leather in my white Lincoln\nShit smellin' like a new purse\nTwo C's on my bitch shit\nMy money risin' like Bisquick\nSix words help you get this\nRich Rapper On Some Crip Shit\nI prayed for blessings as a young nigga\nNot to learn the hard lessons of a drug dealer\nTriple life with a gang enhancement\nThe judge triple white and he hate your blackness\nSlam the gavel with a racist passion\nGot you waitin' on appeals but your patience passin'\nAll you've got to offer is a fight\nIt's too late to run to Christ once you caught up in this life\nLook\n"
}{
    "artist": "Nipsey Hussle",
    "title": "What It Feels Like by Nipsey Hussle & JAY-Z",
    "url": "https://genius.com/Nipsey-hussle-and-jay-z-what-it-feels-like-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle]\nAnd this is what it feels like (Feels like, feels like)\nAnd this is what it feels like (Feels like, feels like)\n\n[Verse 1: Nipsey Hussle]\nLook, the only reason I survive 'cause a nigga is special, first\nYou get successful, then it get stressful, thirst\nNiggas gon' test you, see what your texture's worth\nDiamonds and pipes, one of 'em pressure bursts\nStreet nigga, still I get checks, in spurts\nI'm for peace, but before I get pressed, I murk\nBetter days pray for but expectin' worse\nAt this level, bullshit, I'm just less concernеd\nCruisin' in the 6, lookin' at the proceeds of rap music on my wrist\nDrop another mixtapе, my shit boomin' out this bitch\nYoung Malcolm, I'm the leader of the movement out this bitch, look\nAnd this is what it feels like (Feels like)\nReach a level, make you question, \"Is it real life?\"\nAll the weed good, all the pussy real tight\nAnd the only rule, keep your dollar bills right\n\n[Chorus: Nipsey Hussle]\nAnd this is what it feels like (Feels like, feels like)\nAnd this is what it feels like (Feels like, feels like)\nAnd this is what it feels like (Feels like, feels like)\nAnd this is what it feels like (Feels like, feels like)\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Victory Lap by Nipsey Hussle (Ft. Stacy Barthe)",
    "url": "https://genius.com/Nipsey-hussle-victory-lap-lyrics",
    "lyrics": "[Intro: Stacy Barthe & Arctic Monkeys]\nWoah-oh\nWoah-oh\nWoah-oh\nLike the beginning of Mean Streets, you could (Oh)\nLike the beginning of Mean Streets, you could\nLike the beginning of Mean Streets, you could\n\n[Verse 1: Nipsey Hussle & Arctic Monkeys]\nI'm prolific, so gifted\nI'm the type that's gon' go get it, no kiddin'\nBreaking down a Swisher front of your buildin'\nSitting on the steps, feeling no feelings\nLast night, it was a cold killin'\nYou gotta keep the devil in his hole, nigga\nBut you know how it go, nigga\nI'm front line every time it's on, nigga\nHunnid proof flow, run and shoot pro\n458 drop, playin' \"Bullet Proof Soul\"\nEvery few shows, I just buy some new gold\nCircle got smaller, everybody can't go\nDowntown, Diamond District, jewelers like, \"Yo\nHussle, holla at me, I got Cubans on the low\"\nFlew to Cancun, smokin' Cubans on the boat\nThen docked at Tulum just to smoke, look\nListening to music at the Mayan Ruins\nTrue devotion on the bluest ocean, cruisin'\nMy cultural influence even rival Lucien\nI'm integrated vertically, y'all niggas blew it\nThey tell me, \"Hussle, dumb it down, you might confuse 'em\"\nThis ain't that weirdo rap you motherfuckers used to\nLike the beginning of Mean Streets\nI'm an urban legend, South Central in a certain section\nCan't express how I curved detectives\nGuess it's evidence of a divine presence, blessings\nHeld me down, at times, I seem reckless, F it\nYou got an L, but got an E for effort, stretched him\nDropped him off in the Mojave desert, then left him\nAin't no answer to these trick questions\nMoney Makin' Nip, straighten out my jewelry on my bitch dresser\nWell known, flick up and jail pose\nSnatch a champagne bottle from Rico's 'til T show\nWhatever, nigga, playin' chess, not checkers, nigga\nThirty-eight special for you clever niggas\nSee, bro, if you ain't live and die by the street code\nBeen through all these motions, up and down like a see-saw\nI can never view you as my equal\nFuck I wanna hear your CD for?\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Double Up by Nipsey Hussle (Ft. Belly & DOM KENNEDY)",
    "url": "https://genius.com/Nipsey-hussle-double-up-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle & Belly]\nDouble up\nThree or four times, I ain't tellin' no lies, I just run it up\nNever let a hard time humble us\nDouble up\nI ain't tellin' no lies, I just (Yeah)\nI ain't tellin' no lies, I just\nFive, four, three, two\nThat's time I got to you\nThat money, my dreams come true\nMy life in diamonds, who knew?\nWho knew?\nWho knew?\n\n[Verse 1: Nipsey Hussle]\nTurned seven to a fourteen\nFourteen to a whole thing\nLord knows it's a cold game\nSwitched up on you hoes, man\nBig body take both lanes\nBackseat, blowin' propane\nAll-black, five gold chains\nYoung rich nigga bossed up on his own, man\nMy new shit sound like it's \"Soul Train\"\nTookie Williams over Coltrane\nEric B by the rope chain\nRSC, we for sure bang\nTiny Locs and they go crazy\nWhat you know about the dope game?\nWas you born in the '80s? Did your mama smoke cocaine?\nHave you ever seen a whole thang?\nBut you drove to the streets 'cause you grew up on short change?\nFucked up when the dope age\nIt remind me when these rappers drop duds and they quotes change\nHad the part with the low fade\nI would stand in front of Nix with my sack for the whole day\nDrive-bys, that was road rage\nThen we park and hop out, learn levels to this whole thang\nOld school, play the O'Jays\nTryna make a slow change, mama still slavin' for a low wage\nTryna\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Racks in the Middle by Nipsey Hussle (Ft. Hit-Boy & Roddy Ricch)",
    "url": "https://genius.com/Nipsey-hussle-racks-in-the-middle-lyrics",
    "lyrics": "[Intro: Roddy Ricch]\n(Hit-Boy)\nYeah, yeah, yeah, yeah\n(TrapAdix)\nYeah, yeah, yeah, yeah\nYeah, I was ridin' ’round in the V-12 with the racks in the middle\nI was ridin' 'round in the V-12 with the racks in the middle\nYeah, yeah, yeah, yeah\nAy\n\n[Chorus: Roddy Ricch]\nI was riding ’round in the V-12 with the racks in the middle\nHad to pray to almighty God they let my dog out the kennel\nWhen you get it straight up out the mud, you can't imagine this shit\nI been pullin' up in the drop tops with the baddest bitches\nYoung nigga been focused on my check (Mhmmhm)\nGot a new coupe wrapped around my neck (Mhmmhm)\nTryna put the water on my Patek (Mhmmhm)\nI got killers to the left of me (Mhmmhm)\n\n[Verse 1: Nipsey Hussle]\nWe was lurking on 'em, ain't show no mercy on 'em\nWe was goin' back to back, we put a curfew on 'em\nIt was dark clouds on us, but that was perfect for us\nWe know you always crash and burn, but it was working for us\nLimo tint the V-12, double check the details\nGotta cross my T’s and dot my I’s or I can't sleep well\nMillions off of retail\nOnce again, I prevail\nKnew that shit was over from the day I dropped my presale\nHold up, let the beat build\nSee me in the streets still\nI been fightin’ battles up a steep hill\nThey gave my road dog twelve, it was a sweet deal\nAnd I been ridin' solo tryna rebuild\nLook\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Dedication by Nipsey Hussle (Ft. Kendrick Lamar)",
    "url": "https://genius.com/Nipsey-hussle-dedication-lyrics",
    "lyrics": "[Verse 1: Nipsey Hussle]\nLook, my nigga this is dedication, this is anti-hesitation\nThis a real nigga celebration\nThis a Dime Blocc declaration\n59th and 5th Ave, granny house with vanilla wafers\nThis the remedy, the separation\n2Pac of my generation, blue pill in the fuckin' Matrix\nRed rose in the gray pavement\nYoung black nigga trapped and he can't change it\nKnow he a genius, he just can't claim it\n'Cause they left him no platforms to explain it\nHe frustrated so he get faded\nBut deep down inside he know you can't fade him\nHow long should I stay dedicated?\nHow long 'til opportunity meet preparation?\nI need some real nigga reparations\n'Fore I run up in your bank just for recreation\n\n[Chorus: Nipsey Hussle]\nDedication, hard work plus patience\nThe sum of all my sacrifice, I'm done waitin'\nI'm done waitin', told you that I wasn't playin'\nNow you hear what I been sayin'\nDedication\nIt's dedication, look\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Hussle & Motivate by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-hussle-and-motivate-lyrics",
    "lyrics": "[Verse 1: Nipsey Hussle]\nPull up in motorcades, I got a show today\nThis all I'm tryna do, hustle and motivate\nChoppers a throwaway, hustle the Hova way\nThat's why they follow me, huh? They think I know the way\n'Cause I took control of things, ballin' the solo way\nAnd if you pattern my trend, I make you my protege\nSlauson Ave soldier raised, niggas don't know them days\nTake you in back of the buildings, make you expose your age\nTake you across the tracks, make you explode a face\nNow you official now, but you got a soul to save\nI just been cookin' that new, I'm 'bout to drop in a few\nThink if I call it the great, the people gon' call it the truth\nAin't really trip on the credit, I just paid all of my dues\nI just respected the game, now my name all in the news\nTrippin' on all of my moves, quote me on this, got a lot more to prove\nRemember I came in this bitch fresh out the county with nothin' to lose\n\n[Chorus: Maurice David Wade]\nAnd I don't do this for nothin', nah, from the ground up, yeah\nBut I don't do this shit for nothin', no, no, not at all, yeah\nMy mama need rent, ma need rent, yeah, she do, aw yeah\nSo I don't do this shit for nothin', no, not at all, all\nI told her I got it, oh, yeah\nSo I don't do this shit for nothin', not at all, from the ground up\nHustle and motivate (Woo)\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Blue Laces 2 by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-blue-laces-2-lyrics",
    "lyrics": "[Chorus]\nOh, aw, baby, it's been so long\nOh, aw, baby, it's been so long\n\n[Verse 1]\nMogul and they know that, logo on my floor mat\nCourtside, Chamberlain throwback match my Rolex\nEverywhere I go, flex, valet park on some Loc shit\nWhole lot of smoke in that 'Rari, that thang potent\nBurnin' rubber, wearin' cameras, they was undercovers\nUnder pressure, made statements, turned on they brothers\nNever judge you, but the streets'll never love you\nI wonder what it come to in your brain for you to run to\nOnes that hate us, handcuff us and mace us\nCall us dumb niggas 'cause our culture is contagious\nThird-generation South Central gangbangers\nThat lived long enough to see it changin'\nThink it's time we make arrangements\nFinally wiggle out they mazes\nFind me out in different places\nI'm the spook by the door, this the infiltration\nDouble back dressed in blue laces\n\n[Chorus]\nOh, aw, baby, it's been so long\nOh, aw, baby, it's been so long\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Grinding All My Life by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-grinding-all-my-life-lyrics",
    "lyrics": "[Chorus]\nAll my life, been grindin' all my life\nSacrificed, hustled, paid the price\nWant a slice, got to roll the dice\nThat's why all my life, I been grindin' all my life, look\nAll my life, been grindin' all my life (Yup)\nSacrificed, hustled, paid the price (Woah)\nWant a slice, got to roll the dice\nThat's why all my life, I been grindin' all my life, look\n\n[Verse 1]\nI'm married to this game, that's who I made my wife\nSaid I'd die alone, I told that bitch she probably right\nOne thing that's for sure, not a stranger to this life\nGot a safe that's full of Franklins and a shoulder full of stripes (Ah)\nDon't know a nigga like myself\nI say self-made meanin' I designed myself\nCounty jail fades, you could pull my file yourself\nSpot raid, swallow rocks, I'm gettin' high myself\nLook, and damn right, I like the life I built\nI'm from Westside, 60, shit, I might got killed\nStandin' so tall, they think I might got stilts\nLegendary baller like Mike, like Wilt\n'96 Impala, thug life on wheels\nUp against the walls, squabble at Fox Hills\nLike a motherfuckin' boss, ask me how I feel\nSuccessful street nigga touchin' them first mils (Woah)\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Last Time That I Checc'd by Nipsey Hussle (Ft. YG)",
    "url": "https://genius.com/Nipsey-hussle-last-time-that-i-checcd-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle]\nLast time that I checked\nIt was five chains on my neck\nIt was no smut on my rep\nLast time that I checked (Checked)\nI was sellin' zones in the set (Zones up in the set)\nMake a quarter mil' no sweat\nLast time that I checked\nI'm the streets' voice out West\nLegendary, self-made progress\nLast time that I checked (Checked)\nFirst, you get the money, then respect\nThen the power and the hoes come next\nLast time that I checked (Checked)\n\n[Verse 1: Nipsey Hussle]\nI been self-made from the dribble\nI was been sayin' I'ma kill em, look\nPlaying no games with you niggas\nPop clutch, switch lanes on you niggas, look\nI laid down the game for you niggas\nTaught you how to charge more than what they paid for you niggas\nOwn the whole thing for you niggas\nReinvest, double up, then explain for you niggas\nIt gotta be love, who run the city? It gotta be cuz\nThis for the pieces I took off the Monopoly board\nAnd y'all niggas' false claims, it gotta be fraud\nJust keep the hood up out your mouth or you gotta be charged\nI doubled up, tripled up, nigga, what?\nBanged on the whole game, I ain't give a fuck\nNobody trippin', handled business, got my digits up\nAnd when I drop, you know I'm 'bout to fuck the city up\n"
}{
    "artist": "Nipsey Hussle",
    "title": "Face the World by Nipsey Hussle",
    "url": "https://genius.com/Nipsey-hussle-face-the-world-lyrics",
    "lyrics": "[Produced by 9th Wonder]\n\n[Intro: Sample]\nWhen all dreams seem to die\nThe summer's gone, the breeze stops blowing\nThe sun just leaves the sky\n\n[Verse 1]\nYeah\nUh\nYeah, this your life, you can play with it\nYou make your bed, you gon' lay in it\nDo your thing, just be safe with it\nTriple bunks in the state prison\nBlue laces in my blue chucks\nI ain't never gave two fucks\nBET I chucked the hood up\nAsking if that nigga Nip hood, what\nLike I wouldn't take it to the back with you\nSame nigga walk the track with you\nSame nigga shot a strap with you\nSame nigga bought a sack with you\nNineteen touchin' two birds\nAlpinas off a few swerves\nGrey leather in my white Lincoln\nShit smellin' like a new purse\nTwo C's on my bitch shit\nMy money risin' like Bisquick\nSix words help you get this\nRich Rapper On Some Crip Shit\nI prayed for blessings as a young nigga\nNot to learn the hard lessons of a drug dealer\nTriple life with a gang enhancement\nThe judge triple white and he hate your blackness\nSlam the gavel with a racist passion\nGot you waitin' on appeals but your patience passin'\nAll you've got to offer is a fight\nIt's too late to run to Christ once you caught up in this life\nLook\n"
}{
    "artist": "Nipsey Hussle",
    "title": "What It Feels Like by Nipsey Hussle & JAY-Z",
    "url": "https://genius.com/Nipsey-hussle-and-jay-z-what-it-feels-like-lyrics",
    "lyrics": "[Chorus: Nipsey Hussle]\nAnd this is what it feels like (Feels like, feels like)\nAnd this is what it feels like (Feels like, feels like)\n\n[Verse 1: Nipsey Hussle]\nLook, the only reason I survive 'cause a nigga is special, first\nYou get successful, then it get stressful, thirst\nNiggas gon' test you, see what your texture's worth\nDiamonds and pipes, one of 'em pressure bursts\nStreet nigga, still I get checks, in spurts\nI'm for peace, but before I get pressed, I murk\nBetter days pray for but expectin' worse\nAt this level, bullshit, I'm just less concernеd\nCruisin' in the 6, lookin' at the proceeds of rap music on my wrist\nDrop another mixtapе, my shit boomin' out this bitch\nYoung Malcolm, I'm the leader of the movement out this bitch, look\nAnd this is what it feels like (Feels like)\nReach a level, make you question, \"Is it real life?\"\nAll the weed good, all the pussy real tight\nAnd the only rule, keep your dollar bills right\n\n[Chorus: Nipsey Hussle]\nAnd this is what it feels like (Feels like, feels like)\nAnd this is what it feels like (Feels like, feels like)\nAnd this is what it feels like (Feels like, feels like)\nAnd this is what it feels like (Feels like, feels like)\n"
}